src/cf/Catalogs/CRM_СостоянияСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_СостоянияСобытий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ТипыСостоянийСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/CRM_ТипыСостоянийСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>CRM_ТипыСостоянийСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/CRM_СостоянияСобытий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ЗаполнитьЭлементыСправочника() Экспорт
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CRM_СостоянияСобытий
	|ГДЕ
	|	ТипСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.ПустаяСсылка)
	|");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Если Объект.Предопределенный Тогда
			Попытка Объект.ТипСостояния = Перечисления.CRM_ТипыСостоянийСобытий[Справочники.CRM_СостоянияСобытий.ПолучитьИмяПредопределенного(Выборка.Ссылка)];
			Исключение КонецПопытки;
			Если Не ЗначениеЗаполнено(Объект.ТипСостояния) Тогда
				Объект.ТипСостояния = Перечисления.CRM_ТипыСостоянийСобытий.ВРаботе;
			КонецЕсли;
		Иначе
			Объект.ТипСостояния = Перечисления.CRM_ТипыСостоянийСобытий.ВРаботе;
		КонецЕсли;
		Объект.Записать();
	КонецЦикла;
КонецПроцедуры
#КонецЕсли
